cmydlarz/MEMS-PDM-PSOC5LP/Firmware/PioneerKit_P5LP_USB_Audio/PioneerKit_P5LP_USB_Audio.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
 * File Name: project.h  
 * PSoC Creator 2.2 Component Pack 6
 *
 *  Description:
 *  This file is automatically generated by PSoC Creator and should not 
 *  be edited by hand.
 *
 *
 ********************************************************************************
 * Copyright 2008-2013, Cypress Semiconductor Corporation.  All rights reserved.
 * You may use this file only in accordance with the license, terms, conditions, 
 * disclaimers, and limitations in the end user license agreement accompanying 
 * the software package with which this file was provided.
 ********************************************************************************/

#include <cyfitter_cfg.h>
#include <cydevice.h>
#include <cydevice_trm.h>
#include <cyfitter.h>
#include <PSOC_I2S_SCLK_aliases.h>
#include <PSOC_I2S_SCLK.h>
#include <I2S.h>
#include <AudioClkGen.h>
#include <AudioClkGen_Ref.h>
#include <PSOC_CODEC_RST_aliases.h>
#include <PSOC_CODEC_RST.h>
#include <TxDMA_dma.h>
#include <isr_TxDMADone.h>
#include <PSOC_I2S_SDTO_aliases.h>
#include <PSOC_I2S_SDTO.h>
#include <isr_InDMADone.h>
#include <USBInDMA_dma.h>
#include <PSOC_I2S_MCLK_aliases.h>
#include <PSOC_I2S_MCLK.h>
#include <I2C_Master.h>
#include <I2C_Master_PVT.h>
#include <SCL_aliases.h>
#include <SCL.h>
#include <USBOutDMA_dma.h>
#include <PSOC_SW_aliases.h>
#include <PSOC_SW.h>
#include <PSOC_STATUS_LED_aliases.h>
#include <PSOC_STATUS_LED.h>
#include <SystemTickTimer.h>
#include <isr_Tick.h>
#include <SDA_aliases.h>
#include <SDA.h>
#include <PSOC_I2S_LRCLK_aliases.h>
#include <PSOC_I2S_LRCLK.h>
#include <I2S_Tx_DMA_dma.h>
#include <PSOC_PDM_DataIn_aliases.h>
#include <PSOC_PDM_DataIn.h>
#include <ByteSwap_Tx.h>
#include <Clock_CIC.h>
#include <CICOut_L_dma.h>
#include <Bootloadable.h>
#include <isr_CICOverflow.h>
#include <CICOut_R_dma.h>
#include <PSOC_PDM_ClkOut_aliases.h>
#include <PSOC_PDM_ClkOut.h>
#include <Droop_Filter.h>
#include <RxDMA_dma.h>
#include <isr_RxDMADone.h>
#include <PSOC_PDM_LR_SEL_aliases.h>
#include <PSOC_PDM_LR_SEL.h>
#include <PDM_CIC.h>
#include <USBFS.h>
#include <USBFS_audio.h>
#include <USBFS_cdc.h>
#include <USBFS_hid.h>
#include <USBFS_midi.h>
#include <AudioClkGen_Clock_SCK.h>
#include <AudioClkGen_Clock_I2S.h>
#include <PDM_CIC_DMA_CombD0Update_R_dma.h>
#include <PDM_CIC_DMA_CombD0Update_L_dma.h>
#include <PDM_CIC_Int_Ctrl_Reg.h>
#include <PDM_CIC_Status_Reg.h>
#include <PDM_CIC_DMA_IntOut_L_dma.h>
#include <PDM_CIC_DMA_IntOut_R_dma.h>
#include <USBFS_Dm_aliases.h>
#include <USBFS_Dm.h>
#include <USBFS_Dp_aliases.h>
#include <USBFS_Dp.h>
#include <USBFS_ep1_dma.h>
#include <USBFS_ep2_dma.h>
#include <USBFS_ep4_dma.h>
#include <USBFS_ep6_dma.h>
#include <core_cm3_psoc5.h>
#include <core_cm3.h>
#include <CyDmac.h>
#include <CyFlash.h>
#include <CyLib.h>
#include <cypins.h>
#include <cyPm.h>
#include <CySpc.h>
#include <cytypes.h>

/*[]*/

